In [1]:
import pandas as pd

In [2]:
loan_df = pd.read_csv('data/6.8 loan_df.csv')
print(loan_df.shape)
loan_df.head()

(21126, 2)

        id_loan    id_client
0  1.753791e+09  106804370.0
1  1.753791e+09  106804371.0
2  1.753791e+09  106804372.0
3  1.753791e+09  106804372.0
4  1.753791e+09  106804373.0

In [3]:
# Проверка датафрейма 'loan_df' на наличие незаполненных значений. 
loan_df.isnull().any()

id_loan      False
id_client    False
dtype: bool

In [4]:
# Количество дублирующихся строк.
len(loan_df[loan_df.duplicated()])

0

In [5]:
# Подсчет уникальных значений столбцов.
loan_df.nunique()

id_loan      21126
id_client    15223
dtype: int64

In [6]:
close_loan_df = pd.read_csv('data/6.8 close_loan_df.csv')
print(close_loan_df.shape)
close_loan_df.head()

(21126, 2)

        id_loan  closed_fl
0  1.753791e+09        1.0
1  1.753791e+09        1.0
2  1.753791e+09        1.0
3  1.753791e+09        0.0
4  1.753791e+09        1.0

In [7]:
# Проверка датафрейма 'close_loan_df' на наличие незаполненных значений. 
close_loan_df.isnull().any()

id_loan      False
closed_fl    False
dtype: bool

In [8]:
# Количество дублирующихся строк.
len(close_loan_df[close_loan_df.duplicated()])

0

In [9]:
# Подсчет уникальных значений столбцов.
close_loan_df.nunique()

id_loan      21126
closed_fl        2
dtype: int64

In [10]:
# Объединение датафреймов 'loan_df' и 'close_loan_df' по колонке 'id_loan'.
loan_df = pd.merge(left=loan_df, right=close_loan_df, on='id_loan', how='inner')
print(loan_df.shape)
loan_df.head()

(21126, 3)

        id_loan    id_client  closed_fl
0  1.753791e+09  106804370.0        1.0
1  1.753791e+09  106804371.0        1.0
2  1.753791e+09  106804372.0        1.0
3  1.753791e+09  106804372.0        0.0
4  1.753791e+09  106804373.0        1.0

In [11]:
# Вспомагательный датафрейм с количеством кредитных историй 'loan_num_total', сгруппированных по id-клиента.
stats = loan_df.groupby(['id_client'], as_index=False)[['id_loan']].count()
stats = stats.rename(columns={'id_loan': 'loan_num_total'})
print(stats.shape)
stats.head()

(15223, 2)

     id_client  loan_num_total
0  106804370.0               1
1  106804371.0               1
2  106804372.0               2
3  106804373.0               1
4  106804374.0               2

In [12]:
# Подсчет количества значений числа кредитных историй, которых имеет каждый клиент.
stats.loan_num_total.value_counts()

1     11288
2      2633
3       871
4       275
5       102
6        36
7        14
8         3
11        1
Name: loan_num_total, dtype: int64

In [13]:
# Вспомагательный датафрейм с количеством погашенных кредитов 'loan_num_closed', сгруппированных по id-клиента.
stats2 = loan_df.groupby(['id_client'], as_index=False)[['closed_fl']].sum()
stats2 = stats2.rename(columns={'closed_fl': 'loan_num_closed'})
print(stats2.shape)
stats2.head()

(15223, 2)

     id_client  loan_num_closed
0  106804370.0              1.0
1  106804371.0              1.0
2  106804372.0              1.0
3  106804373.0              1.0
4  106804374.0              1.0

In [14]:
# Подсчет количества значений числа погашенных кредитов, которых имеет каждый клиент.
stats2.loan_num_closed.value_counts()

0.0     7791
1.0     4761
2.0     1770
3.0      603
4.0      202
5.0       62
6.0       26
7.0        5
8.0        2
11.0       1
Name: loan_num_closed, dtype: int64

In [15]:
salary_df = pd.read_csv('data/6.8 salary_df.csv')
salary_df.head()

            family_income  personal_income    id_client
0  от 20000 до 50000 руб.          20000.0  106809321.0
1  от 20000 до 50000 руб.          14000.0  106815561.0
2  от 10000 до 20000 руб.          15000.0  106811521.0
3  от 20000 до 50000 руб.          20000.0  106811252.0
4  от 20000 до 50000 руб.          25000.0  106808620.0

In [16]:
# Удаление колонки 'family_income' датафрейма 'salary_df', которая не портребуется при моделировании.
salary_df = salary_df.drop('family_income', axis=1)
print(salary_df.shape)
salary_df.head()

(15523, 2)

   personal_income    id_client
0          20000.0  106809321.0
1          14000.0  106815561.0
2          15000.0  106811521.0
3          20000.0  106811252.0
4          25000.0  106808620.0

In [17]:
# Проверка датафрейма 'salary_df' на наличие незаполненных значений. 
salary_df.isnull().any()

personal_income    False
id_client          False
dtype: bool

In [18]:
# Количество дублирующихся строк.
len(salary_df[salary_df.duplicated()])

300

In [19]:
# Удаление дублирующихся строк.
salary_df = salary_df.drop_duplicates()
salary_df.shape

(15223, 2)

In [20]:
# Подсчет уникальных значений столбцов.
salary_df.nunique()

personal_income      274
id_client          15223
dtype: int64

In [21]:
agreement_df = pd.read_csv('data/6.8 agreement_df.csv')
print(agreement_df.shape)
agreement_df.head()

(15223, 3)

   agreement_rk    id_client  target
0    59910150.0  106804370.0     0.0
1    59910230.0  106804371.0     0.0
2    59910525.0  106804372.0     0.0
3    59910803.0  106804373.0     0.0
4    59911781.0  106804374.0     0.0

In [22]:
# Проверка датафрейма 'agreement_df' на наличие незаполненных значений.
agreement_df.isnull().any()

agreement_rk    False
id_client       False
target          False
dtype: bool

In [23]:
# Количество дублирующихся строк.
len(agreement_df[agreement_df.duplicated()])

0

In [24]:
# Подсчет уникальных значений столбцов.
agreement_df.nunique()

agreement_rk    15223
id_client       15223
target              2
dtype: int64

In [25]:
clients_df = pd.read_csv('data/6.8 clients_df.csv')
clients_df.head()

,id,age,gender,education,marital_status,child_total,dependants,socstatus_work_fl,socstatus_pens_fl,reg_address_province,fact_address_province,postal_address_province,fl_presence_fl,own_auto
0,106805103.0,42.0,1.0,Среднее,Не состоял в браке,1.0,0.0,2.0,1.0,Московская область,Московская область,Московская область,1.0,0.0
1,106809308.0,28.0,1.0,Среднее специальное,Состою в браке,1.0,1.0,2.0,1.0,Читинская область,Читинская область,Читинская область,0.0,0.0
2,106805867.0,64.0,0.0,Среднее специальное,Состою в браке,2.0,0.0,2.0,2.0,Иркутская область,Иркутская область,Иркутская область,0.0,1.0
3,106808779.0,54.0,1.0,Среднее специальное,Состою в браке,0.0,0.0,2.0,1.0,Новосибирская область,Новосибирская область,Новосибирская область,1.0,1.0
4,106814289.0,26.0,0.0,Среднее специальное,Состою в браке,1.0,1.0,2.0,1.0,Красноярский край,Красноярский край,Красноярский край,1.0,0.0

In [26]:
# Удаление колонок датафрейма 'salary_df', которые не портребуются при моделировании.
clients_df = clients_df.drop(['education', 'marital_status', 'reg_address_province', 'fact_address_province',
                              'postal_address_province', 'fl_presence_fl', 'own_auto'], axis=1)
print(clients_df.shape)
clients_df.head()

(16000, 7)

,id,age,gender,child_total,dependants,socstatus_work_fl,socstatus_pens_fl
0,106805103.0,42.0,1.0,1.0,0.0,2.0,1.0
1,106809308.0,28.0,1.0,1.0,1.0,2.0,1.0
2,106805867.0,64.0,0.0,2.0,0.0,2.0,2.0
3,106808779.0,54.0,1.0,0.0,0.0,2.0,1.0
4,106814289.0,26.0,0.0,1.0,1.0,2.0,1.0

In [27]:
# Проверка датафрейма 'agreement_df' на наличие незаполненных значений.
clients_df.isnull().any()

id                   False
age                  False
gender               False
child_total          False
dependants           False
socstatus_work_fl    False
socstatus_pens_fl    False
dtype: bool

In [28]:
# Количество дублирующихся строк.
len(clients_df[clients_df.duplicated()])

0

In [29]:
# Подсчет уникальных значений столбцов.
clients_df.nunique()

id                   16000
age                     47
gender                   2
child_total             10
dependants               8
socstatus_work_fl        2
socstatus_pens_fl        2
dtype: int64

In [30]:
# Объединение датафреймов 'agreement_df' и 'salary_df' по значениям колонки 'id_client', которые есть в обеих таблицах.
df = pd.merge(left=agreement_df, right=salary_df, on='id_client', how='inner')
print(df.shape)
df.head()

(15223, 4)

   agreement_rk    id_client  target  personal_income
0    59910150.0  106804370.0     0.0           5000.0
1    59910230.0  106804371.0     0.0          12000.0
2    59910525.0  106804372.0     0.0           9000.0
3    59910803.0  106804373.0     0.0          25000.0
4    59911781.0  106804374.0     0.0          12000.0

In [31]:
# Объединение основного датафрейма и 'salary_df' соответственно по значениям колонки 'id_client' и 'id'.
df = pd.merge(left=df, right=clients_df, left_on='id_client', right_on='id', how='inner')
df = df.drop('id', axis=1)
print(df.shape)
df.head()

(15223, 10)

,agreement_rk,id_client,target,personal_income,age,gender,child_total,dependants,socstatus_work_fl,socstatus_pens_fl
0,59910150.0,106804370.0,0.0,5000.0,49.0,1.0,2.0,1.0,2.0,1.0
1,59910230.0,106804371.0,0.0,12000.0,32.0,1.0,3.0,3.0,2.0,1.0
2,59910525.0,106804372.0,0.0,9000.0,52.0,1.0,4.0,0.0,2.0,1.0
3,59910803.0,106804373.0,0.0,25000.0,39.0,1.0,1.0,1.0,2.0,1.0
4,59911781.0,106804374.0,0.0,12000.0,30.0,0.0,0.0,0.0,2.0,1.0

In [32]:
# Объединение основного датафрейма и 'stats', содержащего колонку 'loan_num_total'.
df = pd.merge(left=df, right=stats, on='id_client', how='inner')
print(df.shape)
df.head()

(15223, 11)

,agreement_rk,id_client,target,personal_income,age,gender,child_total,dependants,socstatus_work_fl,socstatus_pens_fl,loan_num_total
0,59910150.0,106804370.0,0.0,5000.0,49.0,1.0,2.0,1.0,2.0,1.0,1
1,59910230.0,106804371.0,0.0,12000.0,32.0,1.0,3.0,3.0,2.0,1.0,1
2,59910525.0,106804372.0,0.0,9000.0,52.0,1.0,4.0,0.0,2.0,1.0,2
3,59910803.0,106804373.0,0.0,25000.0,39.0,1.0,1.0,1.0,2.0,1.0,1
4,59911781.0,106804374.0,0.0,12000.0,30.0,0.0,0.0,0.0,2.0,1.0,2

In [33]:
# Объединение основного датафрейма и 'stats2', содержащего колонку 'loan_num_closed'.
df = pd.merge(left=df, right=stats2, on='id_client', how='inner')
print(df.shape)
df.head()

(15223, 12)

,agreement_rk,id_client,target,personal_income,age,gender,child_total,dependants,socstatus_work_fl,socstatus_pens_fl,loan_num_total,loan_num_closed
0,59910150.0,106804370.0,0.0,5000.0,49.0,1.0,2.0,1.0,2.0,1.0,1,1.0
1,59910230.0,106804371.0,0.0,12000.0,32.0,1.0,3.0,3.0,2.0,1.0,1,1.0
2,59910525.0,106804372.0,0.0,9000.0,52.0,1.0,4.0,0.0,2.0,1.0,2,1.0
3,59910803.0,106804373.0,0.0,25000.0,39.0,1.0,1.0,1.0,2.0,1.0,1,1.0
4,59911781.0,106804374.0,0.0,12000.0,30.0,0.0,0.0,0.0,2.0,1.0,2,1.0

In [34]:
# Сохранение финального датасета для дальнейшего моделирования.
df.to_csv('data/6.8 after_merge_df.csv', index=False)